#数组之 set  - 集合  { }
#set是通过大括号 { } 来包含多个变量的
#set 中的元素, 不能重复, 没有顺序之分
"""
集合(set)像是一个存放贝壳的收集盒,它存储的是无序不重复的元素。
就像每种贝壳只收集一枚一样,set中不允许重复元素。可以进行集合运算,方便地对数据去重、求交集等。
适合需要去重和关系运算的场景。
"""

face_set = {"😊", "😂", "🤣", "😍"}

# #打印出整张set中的具体内容，而不是每个个体
# print(face_set)
# #output : {'😊', '😂', '🤣', '😍'}

# #用for loop 打印
# for x in face_set:
#     print(x, end=" ")
# #output : 😊 😂 😍 🤣
# #这里尤其要注意，没有顺序之分，意味着每次输出的结果中，这四个元素排列的顺序都可能是不一样的。你可以多次运行打印来看看具体结果。


# #尝试加入一个重复的元素，比如：😍
# face_set.add("😍")
# for x in face_set:
#     print(x, end= " ")
# #output : 😊 😂 😍 🤣
# #也就是结果并没有变化，并没有两个😍

# #但是当你尝试加入一个原本不存在的元素，比如：😘
# face_set.add("😘")
# for x in face_set:
#     print(x, end= " ")
# #output : 😊 😂 😍 🤣 😘
# #😘已经被加入了，因为没有顺序之分，所以可能被加在任意位置，不一定是最后。

#简单的判断一个元素是否存在于这个set中 - if语句
# if "😘" in face_set:
#     print("这里有一个亲亲哦~~")
# else:
#     print("年轻人，这里可没有这种鬼东西！")
# #output : 年轻人，这里可没有这种鬼东西！

if "😂" in face_set:
    print("这里有一个哭哭脸哦~~")
else:
    print("年轻人，这里可没有这种鬼东西！")
#output : 这里有一个哭哭脸哦~~


